In [1]:
import pandas as pd

In [2]:
Airports = pd.Series(['Seattle-Tacoma', 'Dulles', 'London-Heathrow', 'Schiphol'])

In [3]:
Airports

0     Seattle-Tacoma
1             Dulles
2    London-Heathrow
3           Schiphol
dtype: object

In [4]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA', 'Schiphol'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']])

# DataFrame Notes

1. Notice that pd.DataFrame is a List of lists.

In [5]:
Airports_City

                 0           1               2         3
0   Seattle-Tacoma     Seattle             USA  Schiphol
1           Dulles  Washington             USA      None
2  London-Heathrow      London  United Kingdom      None
3         Schiphol   Amsterdam     Netherlands      None

In [6]:
Airports_City = pd.DataFrame([['Seattle-Tacoma', 'Seattle', 'USA'],
                            ['Dulles', 'Washington', 'USA'],
                            ['London-Heathrow', 'London', 'United Kingdom'],
                            ['Schiphol', 'Amsterdam', 'Netherlands']], columns = ['Name', 'City', 'Country'])

In [7]:
Airports_City

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

# head(). tail(), info(), shape

In [8]:
Airports_City.head(2)

             Name        City Country
0  Seattle-Tacoma     Seattle     USA
1          Dulles  Washington     USA

In [9]:
Airports_City.tail(2)

              Name       City         Country
2  London-Heathrow     London  United Kingdom
3         Schiphol  Amsterdam     Netherlands

In [10]:
Airports_City.shape

(4, 3)

In [11]:
Airports_City.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   City     4 non-null      object
 2   Country  4 non-null      object
dtypes: object(3)
memory usage: 224.0+ bytes

# Query Data frame - iloc ,

In [12]:
Airports_City[['Name', 'City', 'Country']]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [13]:
Airports_City.iloc[1,2]

'USA'

# also specify a range in the iloc

In [14]:
Airports_City.iloc[:,:]

              Name        City         Country
0   Seattle-Tacoma     Seattle             USA
1           Dulles  Washington             USA
2  London-Heathrow      London  United Kingdom
3         Schiphol   Amsterdam     Netherlands

In [15]:
Airports_City.iloc[:,0:2]

              Name        City
0   Seattle-Tacoma     Seattle
1           Dulles  Washington
2  London-Heathrow      London
3         Schiphol   Amsterdam

In [16]:
airports_data = pd.read_csv('data/airports.csv', on_bad_lines='warn')

b'Skipping line 5: expected 3 fields, saw 4\n'

In [17]:
airports_data

             Name        City         Country
0  Seattle-Tacoma     Seattle             USA
1          Dulles  Washington             USA
2        Heathrow      London  United Kingdom
3          Changi   Singapore       Singapore
4         Pearson     Toronto          Canada
5          Narita       Tokyo           Japan

# Remove column from a data frame either inplace or in another dataframe

In [18]:
flight_delays_df = pd.read_csv('data/flight_delays.csv', on_bad_lines='warn')

In [19]:
flight_delays_df

,FL_DATE,OP_UNIQUE_CARRIER,TAIL_NUM,OP_CARRIER_FL_NUM,ORIGIN,DEST,CRS_DEP_TIME,DEP_TIME,DEP_DELAY,CRS_ARR_TIME,ARR_TIME,ARR_DELAY,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE
0,2018-10-01,WN,N221WN,802,ABQ,BWI,905,903,-2,1450,1433,-17,225,210,197,1670
1,2018-10-01,WN,N8329B,3744,ABQ,BWI,1500,1458,-2,2045,2020,-25,225,202,191,1670
2,2018-10-01,WN,N920WN,1019,ABQ,DAL,1800,1802,2,2045,2032,-13,105,90,80,580
3,2018-10-01,WN,N480WN,1499,ABQ,DAL,950,947,-3,1235,1223,-12,105,96,81,580
4,2018-10-01,WN,N227WN,3635,ABQ,DAL,1150,1151,1,1430,1423,-7,100,92,80,580
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
94,2018-10-01,WN,N230WN,1176,ATL,HOU,1955,1955,0,2105,2057,-8,130,122,101,696
95,2018-10-01,WN,N786SW,1433,ATL,HOU,1130,1308,98,1235,1443,128,125,155,140,696
96,2018-10-01,WN,N452WN,2847,ATL,HOU,605,601,-4,710,659,-11,125,118,99,696
97,2018-10-01,WN,N8619F,5161,ATL,HOU,1340,1333,-7,1440,1503,23,120,150,136,696
98,2018-10-01,WN,N8513F,812,ATL,IAD,1535,1535,0,1725,1727,2,110,112,78,534

In [20]:
flight_delays_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 16 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FL_DATE              99 non-null     object
 1   OP_UNIQUE_CARRIER    99 non-null     object
 2   TAIL_NUM             99 non-null     object
 3   OP_CARRIER_FL_NUM    99 non-null     int64
 4   ORIGIN               99 non-null     object
 5   DEST                 99 non-null     object
 6   CRS_DEP_TIME         99 non-null     int64
 7   DEP_TIME             99 non-null     int64
 8   DEP_DELAY            99 non-null     int64
 9   CRS_ARR_TIME         99 non-null     int64
 10  ARR_TIME             99 non-null     int64
 11  ARR_DELAY            99 non-null     int64
 12  CRS_ELAPSED_TIME     99 non-null     int64
 13  ACTUAL_ELAPSED_TIME  99 non-null     int64
 14  AIR_TIME             99 non-null     int64
 15  DISTANCE             99 non-null     int64
dtypes: int64(11), object(5)
memory usage: 12.5+ KB

# Creating a new dataframe by fetching values from existing data frame by using loc and speicying which columns

In [21]:
flight_delays_qunatitative_df = flight_delays_df.loc[:,['FL_DATE','OP_UNIQUE_CARRIER','TAIL_NUM','OP_CARRIER_FL_NUM','ORIGIN','DEST']]

In [22]:
flight_delays_qunatitative_df

       FL_DATE OP_UNIQUE_CARRIER TAIL_NUM  OP_CARRIER_FL_NUM ORIGIN DEST
0   2018-10-01                WN   N221WN                802    ABQ  BWI
1   2018-10-01                WN   N8329B               3744    ABQ  BWI
2   2018-10-01                WN   N920WN               1019    ABQ  DAL
3   2018-10-01                WN   N480WN               1499    ABQ  DAL
4   2018-10-01                WN   N227WN               3635    ABQ  DAL
..         ...               ...      ...                ...    ...  ...
94  2018-10-01                WN   N230WN               1176    ATL  HOU
95  2018-10-01                WN   N786SW               1433    ATL  HOU
96  2018-10-01                WN   N452WN               2847    ATL  HOU
97  2018-10-01                WN   N8619F               5161    ATL  HOU
98  2018-10-01                WN   N8513F                812    ATL  IAD

[99 rows x 6 columns]

In [23]:
    flight_delays_qunatitative_df.drop(columns = ['FL_DATE'], inplace=True)

In [24]:
flight_delays_qunatitative_df

   OP_UNIQUE_CARRIER TAIL_NUM  OP_CARRIER_FL_NUM ORIGIN DEST
0                 WN   N221WN                802    ABQ  BWI
1                 WN   N8329B               3744    ABQ  BWI
2                 WN   N920WN               1019    ABQ  DAL
3                 WN   N480WN               1499    ABQ  DAL
4                 WN   N227WN               3635    ABQ  DAL
..               ...      ...                ...    ...  ...
94                WN   N230WN               1176    ATL  HOU
95                WN   N786SW               1433    ATL  HOU
96                WN   N452WN               2847    ATL  HOU
97                WN   N8619F               5161    ATL  HOU
98                WN   N8513F                812    ATL  IAD

[99 rows x 5 columns]

# Handling duplicate rows with missing values

In [25]:
Lots_of_flight_data_dframe = pd.read_csv('data/Lots_of_flight_data.csv', on_bad_lines='warn')

In [26]:
Lots_of_flight_data_dframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              300000 non-null  object
 1   OP_UNIQUE_CARRIER    300000 non-null  object
 2   TAIL_NUM             299660 non-null  object
 3   OP_CARRIER_FL_NUM    300000 non-null  int64
 4   ORIGIN               300000 non-null  object
 5   DEST                 300000 non-null  object
 6   CRS_DEP_TIME         300000 non-null  int64
 7   DEP_TIME             296825 non-null  float64
 8   DEP_DELAY            296825 non-null  float64
 9   CRS_ARR_TIME         300000 non-null  int64
 10  ARR_TIME             296574 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     300000 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             300000 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 36.6+ MB

# Handle missing values

In [27]:
Lots_of_flight_data_missingval_removed_df = Lots_of_flight_data_dframe.dropna()

In [28]:
Lots_of_flight_data_missingval_removed_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 295832 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              295832 non-null  object
 1   OP_UNIQUE_CARRIER    295832 non-null  object
 2   TAIL_NUM             295832 non-null  object
 3   OP_CARRIER_FL_NUM    295832 non-null  int64
 4   ORIGIN               295832 non-null  object
 5   DEST                 295832 non-null  object
 6   CRS_DEP_TIME         295832 non-null  int64
 7   DEP_TIME             295832 non-null  float64
 8   DEP_DELAY            295832 non-null  float64
 9   CRS_ARR_TIME         295832 non-null  int64
 10  ARR_TIME             295832 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     295832 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             295832 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 38.4+ MB

# remove duplicate rows

In [29]:
Lots_of_flight_data_missingval_removed_df.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
299995    False
299996    False
299997    False
299998    False
299999    False
Length: 295832, dtype: bool

In [30]:
Lots_of_flight_data_missingval_removed_df[
    Lots_of_flight_data_missingval_removed_df.duplicated()
]

Empty DataFrame
Columns: [FL_DATE, OP_UNIQUE_CARRIER, TAIL_NUM, OP_CARRIER_FL_NUM, ORIGIN, DEST, CRS_DEP_TIME, DEP_TIME, DEP_DELAY, CRS_ARR_TIME, ARR_TIME, ARR_DELAY, CRS_ELAPSED_TIME, ACTUAL_ELAPSED_TIME, AIR_TIME, DISTANCE]
Index: []

# sci kit - Predict flight arrival time - Machine Learning Using Linear Regression model

# Reading flight data and cleaning

In [31]:
delays_df = pd.read_csv('data/Lots_of_flight_data.csv', on_bad_lines='skip')

In [32]:
delays_df.info

<bound method DataFrame.info of            FL_DATE OP_UNIQUE_CARRIER TAIL_NUM  OP_CARRIER_FL_NUM ORIGIN DEST  \
0       2018-10-01                WN   N221WN                802    ABQ  BWI
1       2018-10-01                WN   N8329B               3744    ABQ  BWI
2       2018-10-01                WN   N920WN               1019    ABQ  DAL
3       2018-10-01                WN   N480WN               1499    ABQ  DAL
4       2018-10-01                WN   N227WN               3635    ABQ  DAL
...            ...               ...      ...                ...    ...  ...
299995  2018-10-15                OH   N582NN               5248    CLT  TLH
299996  2018-10-15                OH   N582NN               5248    TLH  CLT
299997  2018-10-15                OH   N706PS               5250    CLT  CRW
299998  2018-10-15                OH   N706PS               5250    CRW  CLT
299999  2018-10-15                OH   N537EA               5252    ORD  DAY

        CRS_DEP_TIME  DEP_TIME  DEP_DELAY  CRS_ARR_TIME  ARR_TIME  ARR_DELAY  \
0                905     903.0       -2.0          1450    1433.0      -17.0
1               1500    1458.0       -2.0          2045    2020.0      -25.0
2               1800    1802.0        2.0          2045    2032.0      -13.0
3                950     947.0       -3.0          1235    1223.0      -12.0
4               1150    1151.0        1.0          1430    1423.0       -7.0
...              ...       ...        ...           ...       ...        ...
299995          1610    1607.0       -3.0          1737    1730.0       -7.0
299996          1808    1804.0       -4.0          1940    1927.0      -13.0
299997           750     745.0       -5.0           901     859.0       -2.0
299998           931     926.0       -5.0          1052    1039.0      -13.0
299999          1820    1817.0       -3.0          2026    2032.0        6.0

        CRS_ELAPSED_TIME  ACTUAL_ELAPSED_TIME  AIR_TIME  DISTANCE
0                    225                210.0     197.0      1670
1                    225                202.0     191.0      1670
2                    105                 90.0      80.0       580
3                    105                 96.0      81.0       580
4                    100                 92.0      80.0       580
...                  ...                  ...       ...       ...
299995                87                 83.0      61.0       386
299996                92                 83.0      65.0       386
299997                71                 74.0      41.0       221
299998                81                 73.0      44.0       221
299999                66                 75.0      38.0       240

[300000 rows x 16 columns]>

In [33]:
delays_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              300000 non-null  object
 1   OP_UNIQUE_CARRIER    300000 non-null  object
 2   TAIL_NUM             299660 non-null  object
 3   OP_CARRIER_FL_NUM    300000 non-null  int64
 4   ORIGIN               300000 non-null  object
 5   DEST                 300000 non-null  object
 6   CRS_DEP_TIME         300000 non-null  int64
 7   DEP_TIME             296825 non-null  float64
 8   DEP_DELAY            296825 non-null  float64
 9   CRS_ARR_TIME         300000 non-null  int64
 10  ARR_TIME             296574 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     300000 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             300000 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 36.6+ MB

In [34]:
delays_df.shape

(300000, 16)

In [35]:
delays_cleaned_df = delays_df.dropna()

In [36]:
delays_cleaned_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 295832 entries, 0 to 299999
Data columns (total 16 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   FL_DATE              295832 non-null  object
 1   OP_UNIQUE_CARRIER    295832 non-null  object
 2   TAIL_NUM             295832 non-null  object
 3   OP_CARRIER_FL_NUM    295832 non-null  int64
 4   ORIGIN               295832 non-null  object
 5   DEST                 295832 non-null  object
 6   CRS_DEP_TIME         295832 non-null  int64
 7   DEP_TIME             295832 non-null  float64
 8   DEP_DELAY            295832 non-null  float64
 9   CRS_ARR_TIME         295832 non-null  int64
 10  ARR_TIME             295832 non-null  float64
 11  ARR_DELAY            295832 non-null  float64
 12  CRS_ELAPSED_TIME     295832 non-null  int64
 13  ACTUAL_ELAPSED_TIME  295832 non-null  float64
 14  AIR_TIME             295832 non-null  float64
 15  DISTANCE             295832 non-null  int64
dtypes: float64(6), int64(5), object(5)
memory usage: 38.4+ MB

In [37]:
X = delays_cleaned_df.loc[:,['DISTANCE', 'CRS_ELAPSED_TIME']]

In [38]:
y = delays_cleaned_df.loc[:,['ARR_DELAY']]

# Using scikit-learn to import train_test_split for the prediction

In [39]:
from sklearn.model_selection import train_test_split

In [40]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [42]:
X_train, X_test, y_train, y_test

(        DISTANCE  CRS_ELAPSED_TIME
 172560      1620               234
 216512      1979               261
 226502      1616               215
 223830       944               151
 179113       740               180
 ...          ...               ...
 120725       221                68
 263004       100                38
 132863      1057               160
 147937      1013               182
 122827       528               118

 [207082 rows x 2 columns],
         DISTANCE  CRS_ELAPSED_TIME
 291483      2378               318
 98997        209                87
 23454       1635               234
 110802      2354               325
 49449        936               166
 ...          ...               ...
 209898       393                92
 22210        622               116
 165727       386                80
 260838        83                70
 192546       461               105

 [88750 rows x 2 columns],
         ARR_DELAY
 172560      -11.0
 216512        7.0
 226502       -7.0
 223830      -19.0
 179113      -36.0
 ...           ...
 120725       -1.0
 263004       -4.0
 132863       60.0
 147937      -14.0
 122827      -13.0

 [207082 rows x 1 columns],
         ARR_DELAY
 291483       -5.0
 98997       -12.0
 23454        -9.0
 110802      -14.0
 49449       -20.0
 ...           ...
 209898      -20.0
 22210        -9.0
 165727       -6.0
 260838      -33.0
 192546        0.0

 [88750 rows x 1 columns])

In [45]:
X_train.head(), y_train.head()

(        DISTANCE  CRS_ELAPSED_TIME
 172560      1620               234
 216512      1979               261
 226502      1616               215
 223830       944               151
 179113       740               180,
         ARR_DELAY
 172560      -11.0
 216512        7.0
 226502       -7.0
 223830      -19.0
 179113      -36.0)

In [46]:
X_test.head(), y_test.head()

(        DISTANCE  CRS_ELAPSED_TIME
 291483      2378               318
 98997        209                87
 23454       1635               234
 110802      2354               325
 49449        936               166,
         ARR_DELAY
 291483       -5.0
 98997       -12.0
 23454        -9.0
 110802      -14.0
 49449       -20.0)

# Import LinearRegression and use the fit method

In [47]:
from sklearn.linear_model import LinearRegression

In [48]:
regressor = LinearRegression()

In [50]:
regressor.fit(X_train, y_train)

LinearRegression()

# Use predict method to check how well data is trained

In [51]:
y_predicted = regressor.predict(X_test)

In [52]:
y_predicted , y_test

(array([[3.47739078],
        [5.89055919],
        [4.33288464],
        ...,
        [5.84678979],
        [6.05195889],
        [5.66255414]]),
         ARR_DELAY
 291483       -5.0
 98997       -12.0
 23454        -9.0
 110802      -14.0
 49449       -20.0
 ...           ...
 209898      -20.0
 22210        -9.0
 165727       -6.0
 260838      -33.0
 192546        0.0

 [88750 rows x 1 columns])

# Check accuracy of the model predictions - Use MSE ( Mean Squared Error )

@ MSE = mean((actual - predicted) ** 2)

In [53]:
from sklearn import metrics

In [60]:
mse = metrics.mean_squared_error(y_test,y_predicted)

In [61]:
print(f'MSE of the model is {mse}')

MSE of the model is 2250.4445141530855

In [59]:
import numpy as np

In [62]:
RMSE = np.sqrt(mse)

In [63]:
print(f'Root MSE of the model is {RMSE}')

Root MSE of the model is 47.4388502617115